app/Exports/Form1Export.php

SELECT * FROM `tahuns` WHERE `tahuns`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
select * from `tahuns`
select * from `tahuns` where `tahuns`.`id` = 7 limit 1
---
    public function view(): View
    {
        return view('menu.capaian.table', [
            'capaians' => Capaian::all(),
            'tahuns' => Tahun::all(),
            'tahunSinggle' => Tahun::findOrFail($this->tahunID),
        ]);