app/Exports/Form5Export.php

select * from `rencana_tindak_lanjuts`
select * from `tujuans` where `tujuans`.`id` in (1, 2)
select * from `users` where `users`.`id` in (2, 6)
---
    public function view(): View
    {
        return view('Menu.RencanaTindakLanjut.table', [
            'rencana_tindak_lanjuts' => RencanaTindakLanjut::with('user', 'tujuan')->get()
        ]);