app/Http/Controllers/CapaianController.php

    public function index($tahunID)
    {
        return view('menu.capaian.index', [
            'capaians' => Capaian::with('indikator.target.tujuan', 'tahun', 'user')->get(),
            'tahuns' => Tahun::all(),
            'tahunSinggle' => Tahun::findOrFail($tahunID),

        ]);
---
select * from `indikators` where `indikators`.`id` in (1, 2, 3, 4, 5)
select * from `tahuns` where `tahuns`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
select * from `targets` where `targets`.`id` in (1, 2, 3)
select * from `tujuans` where `tujuans`.`id` in (1)
SELECT * FROM `tahuns`
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1

    public function edit($id)
    {
        return view('menu.capaian.edit', [
            'capaian' => Capaian::where('id','=', $id)->first(),
        ]);
---
select * from `capaians` where `id` = '7' limit 1