app/Http/Controllers/IndikatorController.php

    public function update(Request $request, Indikator $indikator)
    {
        $rules = $request->validate([
            'tujuan_id' => 'required',
            'target_id' => 'required',
            'kode_indikator' => 'required',
            'deskripsi' => 'required|string',
            'user_id' => 'required',
            'satuan' => ''
        ]);
        Indikator::where('id', $indikator->id)->update($rules);

        $cekCapaian = Capaian::where([
            ['indikator_id', '=', $indikator->id]
        ])->first();


        if ($cekCapaian) {

            $rulesCapaian = $request->validate([
                'indikator_id' => 'required',
                'user_id' => 'required',
            ]);
            Capaian::where('indikator_id', $indikator->id)->update($rulesCapaian);
---
update `capaians` set `indikator_id` = '7', `user_id` = '2', `capaians`.`updated_at` = '2022-06-22 09:26:57' where `indikator_id` = 7