app/Http/Controllers/IndikatorController.php

    public function index()
    {
        return view('menu.indikator.index', [
            'indikators' => Indikator::with('target.tujuan')->get(),
        ]);
---
select * from `indikators`
select * from `targets` where `targets`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100)
select * from `tujuans` where `tujuans`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17)

    public function edit($id)
    {
        return view('menu.indikator.edit', [
            'indikator' => Indikator::where('id','=', $id)->first(),
            'tujuans' => Tujuan::all(),
            'targets' => Target::all(),
            'users' => User::all()
        ]);
---
select * from `indikators` where `id` = '1' limit 1
select * from `tujuans`
select * from `targets`
select * from `users`

    public function update(Request $request, Indikator $indikator)
    {
        $rules = $request->validate([
            'tujuan_id' => 'required',
            'target_id' => 'required',
            'kode_indikator' => 'required',
            'deskripsi' => 'required|string',
            'user_id' => 'required',
            'satuan' => ''
        ]);
        Indikator::where('id', $indikator->id)->update($rules);

        $cekCapaian = Capaian::where([
            ['indikator_id', '=', $indikator->id]
        ])->first();


        if ($cekCapaian) {

            $rulesCapaian = $request->validate([
                'indikator_id' => 'required',
                'user_id' => 'required',
            ]);
            Capaian::where('indikator_id', $indikator->id)->update($rulesCapaian);

        } else {

            $tahuns = Tahun::all();
---
update `indikators` set `tujuan_id` = '1', `target_id` = '3', `kode_indikator` = '1.3.1.(a)', `deskripsi` = 'Proporsi peserta jaminan kesehatan melalui SJSN Bidang Kesehatan', `user_id` = '2', `satuan` = '', `indikators`.`updated_at` = '2022-06-23 16:11:37' where `id` = 5
select * from `capaians` where (`indikator_id` = 5) limit 1
update `indikators` set `tujuan_id` = '1', `target_id` = '1', `kode_indikator` = '1.1.1*', `deskripsi` = 'Tingkat kemiskinan ekstrim', `user_id` = '2', `satuan` = '', `indikators`.`updated_at` = '2022-06-22 07:36:14' where `id` = 1
select * from `capaians` where (`indikator_id` = 1)
update `capaians` set `indikator_id` = '3', `user_id` = '2', `capaians`.`updated_at` = '2022-06-22 10:22:53' where `indikator_id` = 3
select * from `tahuns`

                ]);

                $validatedCreateCapaian['tahun_id'] = $tahun->id;
                Capaian::create($validatedCreateCapaian);
---
insert into `capaians` (`indikator_id`, `user_id`, `tahun_id`, `updated_at`, `created_at`) values ('5', '2', 1, '2022-06-23 16:11:38', '2022-06-23 16:11:38')