app/Http/Controllers/KabkotaController.php

SELECT * FROM `kabkotas` WHERE `id` = 1 LIMIT 1
SELECT * FROM `indikators`
SELECT * FROM `users`
---
    public function edit(Kabkota $kabkotum)
    {
         return view('menu.SubkegiatanKabkota.edit', [
            'kab' => Kabkota::where('id','=', $kabkotum->id)->first(),
            'indikators' => Indikator::all(),
            'users' => User::all()
        ]);