app/Http/Controllers/KegiatanController.php

    public function index()
    {
        return view('Menu.Kegiatan.index',[
            'kegiatans' => Kegiatan::with('user')->get()
        ]);
---
select * from `kegiatans`
select * from `users` where `users`.`id` in (4, 8)

    public function create()
    {
         return view('menu.kegiatan.create', [
            'programs' => Program::all()
        ]);
---
SELECT * FROM `programs`

    public function store(Request $request)
    {
          $validatedData = $request->validate([
            'user_id' => 'required',
            'program_id' => 'required',
            'name_kegiatan' => 'required|string',
        ]);


        Kegiatan::create($validatedData);
---
insert into `kegiatans` (`user_id`, `program_id`, `name_kegiatan`, `updated_at`, `created_at`) values ('4', '1', 'kegitan 2 program 1', '2022-06-24 16:51:35', '2022-06-24 16:51:35')