app/Http/Controllers/MainController.php

    public function index()
    {
        return view('index', [
            'tujuans' => Tujuan::all(),
            'tahun' => Carbon::now()->format('Y'),
        ]);
---
select * from `tujuans`

    public function detail($id, $tahunID)
    {
        // ddd($tahunID);
        return view('tpb-detail', [
            'tujuan' => Tujuan::where('id','=', $id)->first(),
            'tahun' => Tahun::where('tahun', '=', $tahunID)->firstOrFail(),
            'tahunsAll' => Tahun::all(),
            'targets' => Target::all(),
            'indikators' => Indikator::all(),
            'capaians' => Capaian::all(),
---
select * from `tahuns`
select * from `targets`
select * from `indikators`
select * from `capaians`