app/Http/Controllers/PelaporanPembelajaranController.php

select * from `users` where `users`.`id` in (6, 7)
SELECT * FROM `pelaporan_pembelajarans`
---
    public function index()
    {
         return view('Menu.PelaporanPembelajaran.index', [
             'pelaporan_pembelajarans' => PelaporanPembelajaran::with('user')->get()
         ]);

select * from `pelaporan_pembelajarans`
select * from `users` where `users`.`id` in (6)
---
    public function create()
    {
         return view('Menu.PelaporanPembelajaran.create',[
             'pelaporan_pembelajarans' => PelaporanPembelajaran::with('user')->get(),
             'tujuans' => Tujuan::all()
         ]);

insert into `pelaporan_pembelajarans` (`user_id`, `name_file`, `file`, `updated_at`, `created_at`) values ('6', 'Pelaporan pembelajaran disbun', 'file-laporan-pembelajaran/GbJa6PmzoJbK1B3QyMsVkhMrcacfi98aF3bM0NP8.docx', '2022-06-24 17:28:34', '2022-06-24 17:28:34')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'tujuan_id' => 'required',
            'user_id' => 'required',
            'name_program' => 'required|string',
            'lokasi' => 'required',
            'waktu' => 'required',
            'latar_belakang' => 'required',
            'proses_pelaksanaan' => 'required',
            'hasil' => 'required',
            'dampak' => 'required',
            'tantangan' => 'required',
            'pembelajaran' => 'required',
            'peluang_replikasi' => 'required',
            'file' => 'required|mimes:doc,docx,pdf|max:2048',

        ]);

        if ($request->file('file')) {
            $validatedData['file'] = $request->file('file')->store('file-laporan-pembelajaran');
        }

        PelaporanPembelajaran::create($validatedData);

select * from `pelaporan_pembelajarans` where `id` = 2 limit 1
---
    public function show(PelaporanPembelajaran $pp)
    {
        return view('Menu.PelaporanPembelajaran.show', [
            'pp' => PelaporanPembelajaran::findOrFail($pp->id)
        ]);