app/Http/Controllers/PilarController.php

    public function index()
    {
        return view('menu.pilar.index', [
            'pilars' => Pilar::all()
        ]);
---
SELECT * FROM `pilars`