app/Http/Controllers/ProgramPemerintahDaerahController.php

SELECT * FROM `program_pemerintah_daerahs`
---
    public function create()
    {
         return view('Menu.ProgramPemerintahDaerah.create',[
            'tahuns' => Tahun::all(),
            'kegiatans' =>Kegiatan::with('user')->get(),
            'programs' => Program::with('user')->get(),
            'indikators' => Indikator::all(),
        ]);