app/Http/Controllers/ProgramMitraSwastaController.php

select * from `kegiatans` where `kegiatans`.`id` in (1, 4)
select * from `users` where `users`.`id` in (4, 8)
select * from `tahuns` where `tahuns`.`id` = '7' limit 1
SELECT * FROM `indikators` WHERE `indikators`.`id` in (11)
SELECT * FROM `targets` WHERE `targets`.`id` in (5)
SELECT * FROM `tujuans` WHERE `tujuans`.`id` in (1)
---
    public function index($tahunID)
    {
         return view('Menu.ProgramMitraSwasta.index',[
            'tahunSinggle' => Tahun::findOrFail($tahunID),
            'output_kegiatans' => ProgramMitraSwasta::with('kegiatan.program','indikator.target.tujuan' ,'user')->get(),
        ]);

select * from `indikators`
select * from `programs`
SELECT * FROM `tahuns`
select * from `kegiatans`
SELECT * FROM `indikators`
SELECT * FROM `programs`
SELECT * FROM `tujuans`
SELECT * FROM `kegiatans`
SELECT * FROM `users` WHERE `users`.`id` in (6)
---
    public function create()
    {
         return view('Menu.ProgramMitraSwasta.create',[
            'tahuns' => Tahun::all(),
            'indikators' => Indikator::all(),
            'programs' => Program::all(),
            'tujuans' => Tujuan::all(),
            'kegiatans' =>Kegiatan::with('user')->get()
        ]);

INSERT INTO `program_mitra_swastas` (`user_id`, `tahun_id`, `tujuan_id`, `indikator_id`, `kegiatan_id`, `name_outputkegiatan`, `updated_at`, `created_at`) VALUES ('6', '7', '1', '11', '1', 'jakoss', '2022-07-28 13:21:55', '2022-07-28 13:21:55')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'user_id' => 'required',
            'tahun_id' => 'required',
            'tujuan_id' => 'required',
            'indikator_id' => 'required|string',
            // 'program_id' => 'required|string',
            'kegiatan_id'=> 'required|string',
            'name_outputkegiatan' => 'required|string'
        ]);

        ProgramMitraSwasta::create($validatedData);

select * from `program_mitra_swastas` where `id` = 1 limit 1
select * from `tahuns`
---
    public function edit(ProgramMitraSwasta $mitraswastum)
    {
        return view('Menu.ProgramMitraSwasta.edit',[
            'mitraswastum' => ProgramMitraSwasta::where('id','=',$mitraswastum->id)->first(),
            'tahuns' => Tahun::all(),
        ]);