app/Http/Controllers/ProgramPemerintahDaerahController.php

SELECT * FROM `indikators` WHERE `indikators`.`id` in (1)
SELECT * FROM `sub_kegiatans` WHERE `sub_kegiatans`.`id` in (1)
SELECT * FROM `tahuns` WHERE `tahuns`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
SELECT * FROM `targets` WHERE `targets`.`id` in (1)
SELECT * FROM `tahuns`
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
---
    public function index($tahunID)
    {
         return view('Menu.ProgramPemerintahDaerah.index',[
            'program_pemerintah_daerahs' => ProgramPemerintahDaerah::with('indikator.target.tujuan', 'tahun', 'user')->get(),
            'tahuns' => Tahun::all(),
            // 'sub_kegiatan' => SubKegiatan::all(),
            'tahunSinggle' => Tahun::findOrFail($tahunID),
        ]);

SELECT * FROM `program_pemerintah_daerahs` WHERE `id` = 22 LIMIT 1
---
    public function edit(ProgramPemerintahDaerah $pemda)
    {
        return view('Menu.ProgramPemerintahDaerah.edit',[
            'pemda' => ProgramPemerintahDaerah::where('id','=',$pemda->id)->first(),
        ]);

UPDATE `program_pemerintah_daerahs` SET `user_id` = '4', `sub_kegiatan_id` = '2', `target_tahun` = '1', `realisasi_target_sem_1` = '2', `realisasi_target_sem_2` = '3', `alokasi_anggaran` = '4', `realisasi_anggaran_sem_1` = '5', `realisasi_anggaran_sem_2` = '6', `lokasi_pelaksanaan_kegiatan` = '8', `sumber_pendanaan` = '7', `program_pemerintah_daerahs`.`updated_at` = '2022-07-28 13:05:52' WHERE `id` = 22
---
    public function update(Request $request, ProgramPemerintahDaerah $pemda)
    {
        $validatedData = $request->validate([
            'user_id' => 'required',
            // 'tahun_id' => 'required',
            'sub_kegiatan_id'=> 'required|string',
            'target_tahun' => 'required|string',
            'realisasi_target_sem_1' => 'string',
            'realisasi_target_sem_2' => 'string',
            'alokasi_anggaran' => 'required|string',
            'realisasi_anggaran_sem_1' =>'string',
            'realisasi_anggaran_sem_2' =>'string',
            'lokasi_pelaksanaan_kegiatan' => 'required|string',
            'sumber_pendanaan' => 'required|string',
        ]);

        ProgramPemerintahDaerah::where('id', $pemda->id)->update($validatedData);