app/Http/Controllers/ProgramPemerintahPusatController.php

    public function index($tahunID)
    {
        return view('Menu.ProgramPemerintahPusat.index',[
            'tahunSinggle' => Tahun::findOrFail($tahunID),
            'tahuns' => Tahun::all(),
            'programs' => Program::all(),
            'program_pemerintah_pusats' => ProgramPemerintahPusat::with('indikator.target.tujuan','tahun','user', 'kegiatan.program')->get()
        ]);
---
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1
SELECT * FROM `tahuns`
SELECT * FROM `programs`
SELECT * FROM `indikators` WHERE `indikators`.`id` in (6)
SELECT * FROM `kegiatans` WHERE `kegiatans`.`id` in (1)
SELECT * FROM `program_pemerintah_pusats`
SELECT * FROM `programs` WHERE `programs`.`id` in (1)

    public function create()
    {
         return view('Menu.ProgramPemerintahPusat.create',[
            'program_pemerintah_pusats' => ProgramPemerintahPusat::all(),
            'tahuns' => Tahun::all(),
            'indikators'=> Indikator::all(),
            'kegiatans' =>Kegiatan::with('user')->get()
        ]);
---
SELECT * FROM `indikators`
SELECT * FROM `kegiatans`
SELECT * FROM `program_pemerintah_pusats`
SELECT * FROM `programs`
SELECT * FROM `tahuns`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'user_id' => 'required',
            'tahun_id' => 'required',
            'indikator_id' => 'required|string',
            'kegiatan_id'=> 'required|string',
            'kode_rincianoutput' => 'required|string',
            'name_rincianoutput' => 'required|string'
        ]);

        ProgramPemerintahPusat::create($validatedData);
---
INSERT INTO `program_pemerintah_pusats` (`user_id`, `tahun_id`, `indikator_id`, `kegiatan_id`, `kode_rincianoutput`, `name_rincianoutput`, `updated_at`, `created_at`) VALUES ('5', '7', '6', '1', '23', 'vga', '2022-07-28 13:42:05', '2022-07-28 13:42:05')

    public function edit(ProgramPemerintahPusat $pusat)
    {
        return view('Menu.ProgramPemerintahPusat.edit',[
            'pusat' => ProgramPemerintahPusat::where('id','=',$pusat->id)->first(),
            'programs' => Program::all(),
            'tahuns' => Tahun::all(),
            'tujuans' => Tujuan::all(),
            'indikators'=> Indikator::all(),
            'kegiatans' =>Kegiatan::All()

        ]);
---
SELECT * FROM `program_pemerintah_pusats` WHERE `id` = 1 LIMIT 1
SELECT * FROM `programs`
SELECT * FROM `tahuns`
SELECT * FROM `tujuans`
SELECT * FROM `indikators`
SELECT * FROM `kegiatans`

    public function update(Request $request, ProgramPemerintahPusat $pusat)
    {
        $validatedData = $request->validate([
           'user_id' => 'required',
            'tahun_id' => 'required',
            'indikator_id' => 'required|string',
            'kegiatan_id'=> 'required|string',
            'kode_rincianoutput' => 'required|string',
            'name_rincianoutput' => 'required|string',
            'satuan' => 'required|string',
            'target_tahun' => 'required|string',
            'realisasi_target_sem_1' => 'string',
            'realisasi_target_sem_2' => 'string',
            'alokasi_anggaran' => 'required|string',
            'realisasi_anggaran_sem_1' =>'string',
            'realisasi_anggaran_sem_2' =>'string',
            'lokasi_pelaksanaan_kegiatan' => 'required|string',
        ]);

        ProgramPemerintahPusat::where('id', $pusat->id)->update($validatedData);
---
UPDATE `program_pemerintah_pusats` SET `user_id` = '5', `tahun_id` = '7', `indikator_id` = '11', `kegiatan_id` = '1', `kode_rincianoutput` = '23', `name_rincianoutput` = 'vga', `satuan` = '%', `target_tahun` = '1', `realisasi_target_sem_1` = '2', `realisasi_target_sem_2` = '3', `alokasi_anggaran` = '4', `realisasi_anggaran_sem_1` = '5', `realisasi_anggaran_sem_2` = '6', `lokasi_pelaksanaan_kegiatan` = 'samarinda', `program_pemerintah_pusats`.`updated_at` = '2022-07-28 13:46:40' WHERE `id` = 1