app/Http/Controllers/ProgramKabKotaController.php

    public function index($tahunID)
    {
         return view('Menu.ProgramKabKota.index',[
            'program_kab_kotas' => ProgramKabKota::with('kabkota.indikator.tujuan', 'tahun', 'user')->orderBy('id', 'DESC')->get(),
            'tahuns' => Tahun::all(),
            // 'sub_kegiatan' => SubKegiatan::all(),
            'tahunSinggle' => Tahun::findOrFail($tahunID),
        ]);
---
SELECT * FROM `indikators` WHERE `indikators`.`id` in (4)
SELECT * FROM `kabkotas` WHERE `kabkotas`.`id` in (1)
SELECT * FROM `tahuns` WHERE `tahuns`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
SELECT * FROM `users` WHERE `users`.`id` in (6)
SELECT * FROM `tahuns`
SELECT * FROM `tahuns` WHERE `tahuns`.`id` = '7' LIMIT 1