app/Http/Controllers/ProgramController.php

select * from `programs`
select * from `users` where `users`.`id` in (4, 8)
---
    public function index()
    {
        return view('menu.program.index',[
            'programs' => Program::with('user')->get()
        ]);

SELECT * FROM `programs`
---
    public function create()
    {
         return view('menu.program.create',[
            'programs' => Program::with('user')->get(),
            'indikators' => Indikator::all()
        ]);

insert into `programs` (`user_id`, `indikator_id`, `name_program`, `updated_at`, `created_at`) values ('8', '1', 'prog 1', '2022-06-24 17:20:39', '2022-06-24 17:20:39')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'user_id' => 'required',
            'indikator_id' => 'required',
            'name_program' => 'required|string'
        ]);

        Program::create($validatedData);