app/Http/Controllers/ProgramPelakuUsahaController.php

select * from `program_pelaku_usahas`
select * from `users` where `users`.`id` in (5, 7)
---
    public function index()
    {
        return view('Menu.ProgramPelakuUsaha.index',[
            'program_pelaku_usahas' => ProgramPelakuUsaha::with('user')->get()
        ]);

select * from `kegiatans`
select * from `indikators`
select * from `program_pelaku_usahas`
select * from `tahuns`
---
    public function create()
    {
         return view('Menu.ProgramPelakuUsaha.create',[
            'program_pelaku_usahas' => ProgramPelakuUsaha::all(),
            'tahuns' => Tahun::all(),
            'indikators'=> Indikator::all(),
            'kegiatans' =>Kegiatan::with('user')->get()
        ]);