app/Http/Controllers/RencanaTindakLanjutController.php

    public function index()
    {
         return view('Menu.RencanaTindakLanjut.index',[
            'rencana_tindak_lanjuts' => RencanaTindakLanjut::with('user', 'tujuan')->get()
        ]);
---
select * from `rencana_tindak_lanjuts`
select * from `tujuans` where `tujuans`.`id` in (1, 2)
select * from `users` where `users`.`id` in (2, 6)

    public function create()
    {
        return view('Menu.RencanaTindakLanjut.create',[
            'rencana_tindak_lanjuts' => RencanaTindakLanjut::all(),
            'tujuans' => Tujuan::all(),
        ]);
---
select * from `tujuans`
SELECT * FROM `rencana_tindak_lanjuts`
SELECT * FROM `tujuans`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'user_id' => 'required',
            'tujuan_id' => 'required',
            'kategori' => 'required|string',
            'deskripsi'=> 'required|string',
            'rtk'=> 'required|string',
            'pelaksana'=> 'required|string'
        ]);

        RencanaTindakLanjut::create($validatedData);
---
INSERT INTO `rencana_tindak_lanjuts` (`user_id`, `tujuan_id`, `kategori`, `deskripsi`, `rtk`, `pelaksana`, `updated_at`, `created_at`) VALUES ('4', '1', 'sumber daya manusia', 'abcdefghijk', 'tahun depan dilaksanakan', 'Dinas Kehutanan', '2022-07-28 03:45:54', '2022-07-28 03:45:54')

    public function edit(RencanaTindakLanjut $rtl)
    {
         return view('Menu.RencanaTindakLanjut.edit',[
            'rtl' => RencanaTindakLanjut::where('id','=',$rtl->id)->first(),
            'tujuans' => Tujuan::all(),
        ]);
---
select * from `rencana_tindak_lanjuts` where `id` = 4 limit 1
select * from `tujuans`