app/Http/Controllers/SubKegiatanController.php

SELECT * FROM `sub_kegiatans`
---
    public function index()
    {
        return view('Menu.SubKegiatan.index', [
            'subkegiatans' => SubKegiatan::all(),
        ]);

SELECT * FROM `sub_kegiatans` WHERE `id` = 1 LIMIT 1
SELECT * FROM `indikators`
SELECT * FROM `users`
---
    public function edit(SubKegiatan $subkegiatan)
    {
        return view('Menu.SubKegiatan.edit', [
            'subkegiatan' => SubKegiatan::where('id','=', $subkegiatan->id)->first(),
            'indikators' => Indikator::all(),
            'users' => User::all()
        ]);

UPDATE `sub_kegiatans` SET `program` = '01', `kegiatan` = '1.01', `name_sub_kegiatan` = 'Penyusunan Dokumen Perencanaan PerangkatDaerah', `kode_sub_kegiatan` = '1', `indikator_sub` = 'Jumlah Dokumen Perencanaan Perangkat Daerah', `satuan` = 'Dokumen', `user_id` = '4', `indikator_id` = '1', `sub_kegiatans`.`updated_at` = '2022-07-28 13:00:38' WHERE `id` = 1
SELECT * FROM `program_pemerintah_daerahs` WHERE (`sub_kegiatan_id` = 1) LIMIT 1
SELECT * FROM `tahuns`
---
    public function update(Request $request, SubKegiatan $subkegiatan)
    {


            $rules = $request->validate([
                'program' => 'required',
                'kegiatan' => 'required',
                'name_sub_kegiatan' => 'required',
                'kode_sub_kegiatan' => 'required',
                'indikator_sub' => 'required',
                'satuan' => 'required',
                'user_id' => 'required',
                'indikator_id' => 'required'
            ]);

            SubKegiatan::where('id', $subkegiatan->id)->update($rules);


           $cekSubKegitan = ProgramPemerintahDaerah::where([
           ['sub_kegiatan_id', '=', $subkegiatan->id, 'AND', 'user_id', '=', $subkegiatan->user_id != 1]
           ])->first();


            if ($cekSubKegitan) {
                $rulesSubKegiatan = $request->validate([
                    'sub_kegiatan_id' => 'required',
                    'user_id' => 'required',
                ]);

                ProgramPemerintahDaerah::where('sub_kegiatan_id', $subkegiatan->id)->update($rulesSubKegiatan);
            } else {
                $tahuns = Tahun::all();

INSERT INTO `program_pemerintah_daerahs` (`sub_kegiatan_id`, `user_id`, `tahun_id`, `updated_at`, `created_at`) VALUES ('1', '4', 1, '2022-07-28 13:00:38', '2022-07-28 13:00:38')
---
                    ]);

                    $validatedsubkegiatan['tahun_id'] = $tahun->id;
                    ProgramPemerintahDaerah::create($validatedsubkegiatan);