app/Http/Controllers/TargetController.php

select * from `targets`
---
    public function index()
    {
        return view('menu.target.index', [
            'targets' => Target::all()
        ]);

select * from `targets` where `id` = '1' limit 1
select * from `tujuans`
---
    public function edit($id)
    {
        return view('menu.target.edit',[
            'target' => Target::where('id','=', $id)->first(),
            'tujuans' => Tujuan::all()
        ]);