app/Http/Controllers/TujuanController.php

SELECT * FROM `tujuans`
---
    public function index()
    {
        return view('Menu.Tujuan.index', [
            'tujuans' => Tujuan::all()
        ]);

SELECT * FROM `tujuans` WHERE `id` = '1' LIMIT 1
SELECT * FROM `pilars`
---
    public function edit($id)
    {
        return view('Menu.Tujuan.edit',[
            'tujuan' => Tujuan::where('id','=', $id)->first(),
            'pilars' => Pilar::all()
        ]);